Repository: nh36/ChinTransMem
Catalog: corpus/exports/tmx/mengzi__all__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 有為神農之言者許行，自楚之滕，踵門而告文公，曰：「遠方之人，聞君行仁政，愿受一廛而為氓。」文公與之處。其徒數十人，皆衣褐、捆屨、織席以為食。陳良之徒陳相與其弟辛，負耒耜而自宋之滕。曰：「聞君行聖人之政，是亦聖人也，愿為聖人氓。」陳相見許行而大悅，盡棄其學而學焉。陳相見孟子，道許行之言曰：「滕君則誠賢君也；雖然，未聞道也。賢者與民并耕而食，饔飧而治。今也滕有倉廩府庫，則是厲民而以自養也，惡得賢？」孟子曰：「許子必種粟而後食乎？」曰：「然。」「許子必織布而後衣乎？」曰：「否，許子衣褐。」「許子冠乎？」曰：「冠。」曰：「奚冠？」曰：「冠素。」曰：「自織之與？」曰：「否，以粟易之。」曰：「許子奚為不自織？」曰：「害於耕。」曰：「許子以釜甑爨、以鐵耕乎？」曰：「然。」「自為之與？」曰：「否，以粟易之。」「以粟易械器者，不為厲陶冶；陶冶亦以其械器易粟者，豈為厲農夫哉？且許子何不為陶冶，舍皆取諸其宮中而用之？何為紛紛然與百工交易？何許子之不憚煩？」曰：「百工之事，固不可耕且為也。」「然則治天下獨可耕且為與？有大人之事，有小人之事。且一人之身，而百工之所為備。如必自為而後用之，是率天下而路也。故曰：或勞心，或勞力。勞心者治人，勞力者治於人。治於人者食人，治人者食於人──天下之通義也。」「當堯之時，天下猶未平，洪水橫流，氾濫於天下；草木暢茂，禽獸繁殖；五穀不登，禽獸偪人；獸蹄鳥跡之道，交於中國。堯獨憂之，舉舜而敷治焉。舜使益掌火；益烈山澤而焚之，禽獸逃匿。禹疏九河，瀹濟、漯而注諸海；決汝、漢，排淮、泗，而注之江，然後中國可得而食也。當是時也，禹八年於外，三過其門而不入，雖欲耕，得乎？」「后稷教民稼穡，樹藝五穀，五穀熟而民人育。人之有道也，飽食煖衣，逸居而無教，則近於禽獸。聖人有憂之，使契為司徒，教以人倫：父子有親，君臣有義，夫婦有別，長幼有序，朋友有信。放勛曰：『勞之來之、匡之直之、輔之翼之，使自得之；又從而振德之。』聖人之憂民如此，而暇耕乎？」「堯以不得舜為己憂；舜以不得禹、皋陶為己憂。夫以百畝之不易為己憂者，農夫也。分人以財謂之惠，教人以善謂之忠，為天下得人者謂之仁。是故以天下與人易，為天下得人難。孔子曰：『大哉，堯之為君！惟天為大，惟堯則之。蕩蕩乎民無能名焉！君哉舜也！巍巍乎有天下而不與焉！』堯舜之治天下，豈無所用其心哉？亦不用於耕耳。」「吾聞用夏變夷者，未聞變於夷者也。陳良，楚產也；悅周公、仲尼之道，北學於中國，北方之學者，未能或之先也。彼所謂豪傑之士也。子之兄弟事之數十年，師死而遂倍之。昔者孔子沒，三年之外，門人治任將歸，入揖於子貢，相向而哭，皆失聲，然後歸。子貢反，筑室於場，獨居三年，然後歸。他日子夏、子張、子游以有若似聖人，欲以所事孔子事之，強曾子。曾子曰：『不可，江漢以濯之，秋陽以暴之，皜皜乎不可尚已。』今也南蠻鴃舌之人，非先王之道，子倍子之師而學之，亦異於曾子矣。吾聞出於幽谷、遷于喬木者，未聞下喬木而入於幽谷者。魯頌曰：『戎狄是膺，荊舒是懲。』周公方且膺之，子是之學，亦為不善變矣。」「從許子之道，則市賈不貳，國中無偽；雖使五尺之童適市，莫之或欺。布帛長短同，則賈相若；麻縷絲絮輕重同，則賈相若；五穀多寡同，則賈相若；屨大小同，則賈相若。」曰：「夫物之不齊，物之情也。或相倍蓰，或相什百，或相千萬；子比而同之，是亂天下也。巨屨小屨同賈，人豈為之哉？從許子之道，相率而為偽者也，惡能治國家？」
en: There came from Chu to Teng one Xu Xing, who gave out that he acted according to the words of Shen Nong. Coming right to his gate, he addressed the duke Wen, saying, 'A man of a distant region, I have heard that you, Prince, are practising a benevolent government, and I wish to receive a site for a house, and to become one of your people.' The duke Wen gave him a dwelling-place. His disciples, amounting to several tens, all wore clothes of haircloth, and made sandals of hemp and wove mats for a living. At the same time, Chen Xiang, a disciple of Chen Liang, and his younger brother, Xin, with their plough-handles and shares on their backs, came from Song to Teng, saying, 'We have heard that you, Prince, are putting into practice the government of the ancient sages, showing that you are likewise a sage. We wish to become the subjects of a sage.' When Chen Xiang saw Xu Xing, he was greatly pleased with him, and, abandoning entirely whatever he had learned, became his disciple. Having an interview with Mencius, he related to him with approbation the words of Xu Xing to the following effect: 'The prince of Teng is indeed a worthy prince. He has not yet heard, however, the real doctrines of antiquity. Now, wise and able princes should cultivate the ground equally and along with their people, and eat the fruit of their labour. They should prepare their own meals, morning and evening, while at the same time they carry on their government. But now, the prince of T'ang has his granaries, treasuries, and arsenals, which is an oppressing of the people to nourish himself. How can he be deemed a real worthy prince?' Mencius said,'I suppose that Xu Xing sows grain and eats the produce. Is it not so?' 'It is so,' was the answer. 'I suppose also he weaves cloth, and wears his own manufacture. Is it not so?' 'No. Xu wears clothes of haircloth.' 'Does he wear a cap?' 'He wears a cap.' 'What kind of cap?' 'A plain cap.' 'Is it woven by himself?' 'No. He gets it in exchange for grain.' 'Why does Xu not weave it himself?' 'That would injure his husbandry.' 'Does Xu cook his food in boilers and earthenware pans, and does he plough with an iron share?' 'Yes.' 'Does he make those articles himself?' 'No. He gets them in exchange for grain.' Mencius then said, 'The getting those various articles in exchange for grain, is not oppressive to the potter and the founder, and the potter and the founder in their turn, in exchanging their various articles for grain, are not oppressive to the husbandman. How should such a thing be supposed? And moreover, why does not Xu act the potter and founder, supplying himself with the articles which he uses solely from his own establishment? Why does he go confusedly dealing and exchanging with the handicraftsmen? Why does he not spare himself so much trouble?' Chen Xiang replied, 'The business of the handicraftsman can by no means be carried on along with the business of husbandry.' Mencius resumed, 'Then, is it the government of the kingdom which alone can be carried on along with the practice of husbandry? Great men have their proper business, and little men have their proper business. Moreover, in the case of any single individual, whatever articles he can require are ready to his hand, being produced by the various handicraftsmen - if he must first make them for his own use, this way of doing would keep all the people running about upon the roads. Hence, there is the saying, "Some labour with their minds, and some labour with their strength. Those who labour with their minds govern others; those who labour with their strength are governed by others. Those who are governed by others support them; those who govern others are supported by them." This is a principle universally recognised. 'In the time of Yao, when the world had not yet been perfectly reduced to order, the vast waters, flowing out of their channels, made a universal inundation. Vegetation was luxuriant, and birds and beasts swarmed. The various kinds of grain could not be grown. The birds and beasts pressed upon men. The paths marked by the feet of beasts and prints of birds crossed one another throughout the Middle Kingdom. To Yao alone this caused anxious sorrow. He raised Shun to office, and measures to regulate the disorder were set forth. Shun committed to Yi the direction of the fire to be employed, and Yi set fire to, and consumed, the forests and vegetation on the mountains and in the marshes, so that the birds and beasts fled away to hide themselves. Yu separated the nine streams, cleared the courses of the Ji and Ta, and led them all to the sea. He opened a vent also for the Ru and Han, and regulated the course of the Huai and Si, so that they all flowed into the Jiang. When this was done, it became possible for the people of the Middle Kingdom to cultivate the ground and get food for themselves. During that time, Yu was eight years away from his home, and though he thrice passed the door of it, he did not enter. Although he had wished to cultivate the ground, could he have done so? The Minister of Agriculture taught the people to sow and reap, cultivating the five kinds of grain. When the five kinds of grain were brought to maturity, the people all obtained a subsistence. But men possess a moral nature; and if they are well fed, warmly clad, and comfortably lodged, without being taught at the same time, they become almost like the beasts. This was a subject of anxious solicitude to the sage Shun, and he appointed Xie to be the Minister of Instruction, to teach the relations of humanity: how, between father and son, there should be affection; between sovereign and minister, righteousness; between husband and wife, attention to their separate functions; between old and young, a proper order; and between friends, fidelity. The high meritorious sovereign said to him, "Encourage them; lead them on; rectify them; straighten them; help them; give them wings - thus causing them to become possessors of themselves. Then follow this up by stimulating them, and conferring benefits on them." When the sages were exercising their solicitude for the people in this way, had they leisure to cultivate the ground? 'What Yao felt giving him anxiety was the not getting Shun. What Shun felt giving him anxiety was the not getting Yu and Gao Yao. But he whose anxiety is about his hundred mu not being properly cultivated, is a mere husbandman. The imparting by a man to others of his wealth, is called "kindness." The teaching others what is good, is called "the exercise of fidelity." The finding a man who shall benefit the kingdom, is called "benevolence." Hence to give the throne to another man would be easy; to find a man who shall benefit the kingdom is difficult. Confucius said, "Great indeed was Yao as a sovereign. It is only Heaven that is great, and only Yao corresponded to it. How vast was his virtue! The people could find no name for it. Princely indeed was Shun! How majestic was he, having possession of the kingdom, and yet seeming as if it were nothing to him!" In their governing the kingdom, were there no subjects on which Yao and Shun employed their minds? There were subjects, only they did not employ their minds on the cultivation of the ground. 'I have heard of men using the doctrines of our great land to change barbarians, but I have never yet heard of any being changed by barbarians. Chen Liang was a native of Chu. Pleased with the doctrines of Zhou Gong and Zhong Ni, he came northwards to the Middle Kingdom and studied them. Among the scholars of the northern regions, there was perhaps no one who excelled him. He was what you call a scholar of high and distinguished qualities. You and your brother followed him some tens of years, and when your master died, you forthwith turned away from him. Formerly, when Confucius died, after three vears had elapsed, his disciples collected their baggage, and prepared to return to their several homes. But on entering to take their leave of Zi Gong, as they looked towards one another, they wailed, till they all lost their voices. After this they returned to their homes, but Zi Gong went back, and built a house for himself on the altar-ground, where he lived alone other three years, before he returned home. On another occasion, Zi Xia, Zi Zhang, and Zi You, thinking that You Ruo resembled the sage, wished to render to him the same observances which they had rendered to Confucius. They tried to force the disciple Zeng to join with them, but he said, "This may not be done. What has been washed in the waters of the Jiang and Han, and bleached in the autumn sun - how glistening is it! Nothing can be added to it." Now here is this shrike-tongued barbarian of the south, whose doctrines are not those of the ancient kings. You turn away from your master and become his disciple. Your conduct is different indeed from that of the philosopher Zeng. I have heard of birds leaving dark valleys to remove to lofty trees, but I have not heard of their descending from lofty trees to enter into dark valleys. In the Praise-songs of Lu it is said, "He smote the barbarians of the west and the north, He punished Jing and Shu." Thus Zhou Gong would be sure to smite them, and you become their disciple again; it appears that your change is not good.' Chen Xiang said, 'If Xu's doctrines were followed, then there would not be two prices in the market, nor any deceit in the kingdom. If a boy of five cubits were sent to the market, no one would impose on him; linen and silk of the same length would be of the same price. So it would be with bundles of hemp and silk, being of the same weight; with the different kinds of grain, being the same in quantity; and with shoes which were of the same size.' Mencius replied, 'It is the nature of things to be of unequal quality. Some are twice, some five times, some ten times, some a hundred times, some a thousand times, some ten thousand times as valuable as others. If you reduce them all to the same standard, that must throw the kingdom into confusion. If large shoes and small shoes were of the same price, who would make them? For people to follow the doctrines of Xu, would be for them to lead one another on to practise deceit. How can they avail for the government of a State?'

source: 墨者夷之，因徐辟而求見孟子。孟子曰：「吾固愿見，今吾尚病，病愈，我且往見。」夷子不來！他日又求見孟子。孟子曰：「吾今則可以見矣。不直則道不見，我且直之。吾聞夷子墨者，墨者之治喪也，以薄為其道也。夷子思以易天下，豈以為非是而不貴也？然而夷子葬其親厚，則是以所賤事親也。」徐子以告夷子。夷子曰：「儒者之道，古之人『若保赤子』，此言何謂也？之則以為愛無差等，施由親始。」徐子以告孟子。孟子曰：「夫夷子信以為人之親其兄之子為若親其鄰之赤子乎？彼有取爾也。赤子匍匐將入井，非赤子之罪也。且天之生物也使之一本，而夷子二本故也。蓋上世嘗有不葬其親者，其親死則舉而委之於壑。他日過之，狐貍食之，蠅蚋姑嘬之。其顙有泚，睨而不視。夫泚也，非為人泚，中心達於面目。蓋歸反虆梩而掩之，掩之誠是也。則孝子仁人之掩其親，亦必有道矣。」徐子以告夷子。夷子憮然為間曰：「命之矣！」
en: The Mohist, Yi Zhi, sought, through Xu Bi, to see Mencius. Mencius said, 'I indeed wish to see him, but at present I am still unwell. When I am better, I will myself go and see him. He need not come here again.' Next day, Yi Zhi again sought to see Mencius. Mencius said, 'To-day I am able to see him. But if I do not correct his errors, the true principles will not be fully evident. Let me first correct him. I have heard that this Yi is a Mohist. Now Mo considers that in the regulation of funeral matters a spare simplicity should be the rule. Yi thinks with Mo's doctrines to change the customs of the kingdom - how does he regard them as if they were wrong, and not honour them? Notwithstanding his views, Yi buried his parents in a sumptuous manner, and so he served them in the way which his doctrines discountenance.' The disciple Xu informed Yi of these remarks. Yi said, 'Even according to the principles of the learned, we find that the ancients acted towards the people "as if they were watching over an infant." What does this expression mean? To me it sounds that we are to love all without difference of degree; but the manifestation of love must begin with our parents.' Xu reported this reply to Mencius, who said, 'Now, does Yi really think that a man's affection for the child of his brother is merely like his affection for the infant of a neighbour? What is to be approved in that expression is simply this: that if an infant crawling about is likely to fall into a well, it is no crime in the infant. Moreover, Heaven gives birth to creatures in such a way that they have one root, and Yi makes them to have two roots. This is the cause of his error. And, in the most ancient times, there were some who did not inter their parents. When their parents died, they took them up and threw them into some water-channel. Afterwards, when passing by them, they saw foxes and wild-cats devouring them, and flies and gnats biting at them. The perspiration started out upon their foreheads, and they looked away, unable to bear the sight. It was not on account of other people that this perspiration flowed. The emotions of their hearts affected their faces and eyes, and instantly they went home, and came back with baskets and spades and covered the bodies. If the covering them thus was indeed right, you may see that the filial son and virtuous man, in interring in a handsome manner their parents, act according to a proper rule.' The disciple Xu informed Yi of what Mencius had said. Yi was thoughtful for a short time, and then said, 'He has instructed me.'

source: 陳代曰：「不見諸侯，宜若小然。今一見之，大則以王，小則以霸。且《志》曰：『枉尺而直尋。』宜若可為也。」孟子曰：「昔齊景公田，招虞人以旌，不至，將殺之。『志士不忘在溝壑，勇士不忘喪其元。』孔子奚取焉？取非其招不往也。如不待其招而往，何哉？且夫枉尺而直尋者，以利言也。如以利，則枉尋直尺而利，亦可為與？昔者趙簡子使王良與嬖奚乘，終日而不獲一禽。嬖奚反命曰：『天下之賤工也。』或以告王良，良曰：『請復之。』強而後可，一朝而獲十禽。嬖奚反命曰：『天下之良工也。』簡子曰：『我使掌與女乘。』謂王良。良不可，曰：『吾為之范，我馳驅，終日不獲一；為之詭遇，一朝而獲十。《詩》云：「不失其馳，舍矢如破。」我不貫與小人乘，請辭。』御者且羞與射者比。比而得禽獸，雖若丘陵，弗為也。如枉道而從彼，何也？且子過矣，枉己者，未有能直人者也。」
en: Chen Dai said to Mencius, 'In not going to wait upon any of the princes, you seem to me to be standing on a small point. If now you were once to wait upon them, the result might be so great that you would make one of them sovereign, or, if smaller, that you would make one of them chief of all the other princes. Moreover, the History says, "By bending only one cubit, you make eight cubits straight." It appears to me like a thing which might be done.' Mencius said, 'Formerly, the duke Jing of Qi, once when he was hunting, called his forester to him by a flag. The forester would not come, and the duke was going to kill him. With reference to this incident, Confucius said, "The determined officer never forgets that his end may be in a ditch or a stream; the brave officer never forgets that he may lose his head." What was it in the forester that Confucius thus approved? He approved his not going to the duke, when summoned by the article which was not appropriate to him. If one go to see the princes without waiting to be invited, what can be thought of him? Moreover, that sentence, "By bending only one cubit, you make eight cubits straight," is spoken with reference to the gain that may be got. If gain be the object, then, if it can be got by bending eight cubits to make one cubit straight, may we likewise do that? Formerly, the officer Zhao Jian made Wang Liang act as charioteer for his favourite Xi, when, in the course of a whole day, they did not get a single bird. The favourite Xi reported this result, saying, "He is the poorest charioteer in the world." Some one told this to Wang Liang, who said, "I beg leave to try again." By dint of pressing, this was accorded to him, when in one morning they got ten birds. The favourite, reporting this result, said, "He is the best charioteer in the world." Jian said, "I will make him always drive your chariot for you." When he told Wang Liang so, however, Liang refused, saying, "I drove for him, strictly observing the proper rules for driving, and in the whole day he did not get one bird. I drove for him so as deceitfully to intercept the birds, and in one morning he got ten. It is said in the Book of Poetry, 'There is no failure in the management of their horses; The arrows are discharged surely, like the blows of an axe.' I am not accustomed to drive for a mean man. I beg leave to decline the office." Thus this charioteer even was ashamed to bend improperly to the will of such an archer. Though, by bending to it, they would have caught birds and animals sufficient to form a hill, he would not do so. If I were to bend my principles and follow those princes, of what kind would my conduct be? And you are wrong. Never has a man who has bent himself been able to make others straight.'

source: 景春曰：「公孫衍、張儀豈不誠大丈夫哉？一怒而諸侯懼，安居而天下熄。」孟子曰：「是焉得為大丈夫乎？子未學禮乎？丈夫之冠也，父命之；女子之嫁也，母命之，往送之門，戒之曰：『往之女家，必敬必戒，無違夫子。』以順為正者，妾婦之道也。居天下之廣居，立天下之正位，行天下之大道；得志與民由之，不得志，獨行其道；富貴不能淫，貧賤不能移，威武不能屈──此之謂大丈夫。」
en: Jing Chun said to Mencius, 'Are not Gong Sun Yan and Zhang Yi really great men? Let them once be angry, and all the princes are afraid. Let them live quietly, and the flames of trouble are extinguished throughout the kingdom.' Mencius said, 'How can such men be great men? Have you not read the Ritual Usages? "At the capping of a young man, his father admonishes him. At the marrying away of a young woman, her mother admonishes her, accompanying her to the door on her leaving, and cautioning her with these words, 'You are going to your home. You must be respectful; you must be careful. Do not disobey your husband.'" Thus, to look upon compliance as their correct course is the rule for women. To dwell in the wide house of the world, to stand in the correct seat of the world, and to walk in the great path of the world; when he obtains his desire for office, to practise his principles for the good of the people; and when that desire is disappointed, to practise them alone; to be above the power of riches and honours to make dissipated, of poverty and mean condition to make swerve from principle, and of power and force to make bend - these characteristics constitute the great man.'

source: 周霄問曰：「古之君子仕乎？」孟子曰：「仕。傳曰：『孔子三月無君，則皇皇如也。出疆必載質。』公明儀曰：『古之人三月無君則弔。』」「三月無君則弔，不以急乎？」曰：「士之失位也，猶諸侯之失國家也。《禮》曰：『諸侯耕助，以供粢盛。夫人蠶繅，以為衣服。犧牲不成，粢盛不潔，衣服不備，不敢以祭。惟士無田，則亦不祭。』牲殺器皿衣服不備，不敢以祭，則不敢以宴，亦不足弔乎？」「出疆必載質，何也？」曰：「士之仕也，猶農夫之耕也。農夫豈為出疆舍其耒耜哉？」曰：「晉國亦仕國也，未嘗聞仕如此其急。仕如此其急也，君子之難仕，何也？」曰：「丈夫生而愿為之有室，女子生而愿為之有家。父母之心，人皆有之。不待父母之命、媒妁之言，鉆穴隙相窺，逾墻相從，則父母、國人皆賤之。古之人未嘗不欲仕也，又惡不由其道。不由其道而往者，與鉆穴隙之類也。」
en: Zhou Xiao asked Mencius, saying, 'Did superior men of old time take office?' Mencius replied, 'They did. The Record says, "If Confucius was three months without being employed by some ruler, he looked anxious and unhappy. When he passed from the boundary of a State, he was sure to carry with him his proper gift of introduction." Gong Ming Yi said, "Among the ancients, if an officer was three months unemployed by a ruler, he was condoled with."' Xiao said, 'Did not this condoling, on being three months unemployed by a ruler, show a too great urgency?' Mencius answered, 'The loss of his place to an officer is like the loss of his State to a prince. It is said in the Book of Rites, "A prince ploughs himself, and is assisted by the people, to supply the millet for sacrifice. His wife keeps silkworms, and unwinds their cocoons, to make the garments for sacrifice." If the victims be not perfect, the millet not pure, and the dress not complete, he does not presume to sacrifice. "And the scholar who, out of office, has no holy field, in the same way, does not sacrifice. The victims for slaughter, the vessels, and the garments, not being all complete, he does not presume to sacrifice, and then neither may he dare to feel happy." Is there not here sufficient ground also for condolence?' Xiao again asked, 'What was the meaning of Confucius's always carrying his proper gift of introduction with him, when he passed over the boundaries of the State where he had been?' 'An officer's being in office,' was the reply, 'is like the ploughing of a husbandman. Does a husbandman part with his plough, because he goes from one State to another?' Xiao pursued, 'The kingdom of Jin is one, as well as others, of official employments, but I have not heard of anyone being thus earnest about being in office. If there should be this urge why does a superior man make any difficulty about taking it?' Mencius answered, 'When a son is born, what is desired for him is that he may have a wife; when a daughter is born, what is desired for her is that she may have a husband. This feeling of the parents is possessed by all men. If the young people, without waiting for the orders of their parents, and the arrangements of the go-betweens, shall bore holes to steal a sight of each other, or get over the wall to be with each other, then their parents and all other people will despise them. The ancients did indeed always desire to be in office, but they also hated being so by any improper way. To seek office by an improper way is of a class with young people's boring holes.'
